Tekla.Structures.Plugins.ConnectionBase.SeamInputType
Defines the type of the input.

Tekla.Structures.Plugins.ConnectionBase.SeamInputType.INPUT_2_POINTS
The input is two points. The data is returned as an array list of points.

Tekla.Structures.Plugins.ConnectionBase.SeamInputType.INPUT_POLYGON
The input is any number of points (a polygon). The data is returned as an array list of points.